// SETTINGS
// These are the general settings for the service. There's also a settings.development.json
// and a settings.production.json, each one containing environment-specific settings.
// In 99% of the cases, customizations should be set on the settings.private.json file.

{
    "amazon": {
        // Add a 0.5% on top of transfers from main account to the amazon account,
        // as a buffer for occasional fees.
        "paymentMultiplier": 1.005
    },
    "app": {
        // List of IPs allowed to access Jarbunq pages. Leave blank to allow all.
        "allowedIP": [],
        // Port in which the server should run.
        "port": 8833,
        // Name of this service, will also be used as the device name when connecting to bunq.
        "title": "Jarbunq",
        // Frontend files served by Expresser are all located on /assets.
        "publicPath": "./assets/"
    },
    "bunq": {
        "api": {
            // Default 16 bytes crypto hex key for API communication, it's strongly advised that you update
            // this value on yout settings.private.json file!
            "cryptoKey": "13841C2E4529CFB112324B7DE0EDB781",
            // If you wish to make some tests, please set this to "SANDBOX".
            "environment": "PRODUCTION"
        },
        // Set to true to use draft payments (that needs approval) by default.
        // Please note parts of the code can still force the options.draff.
        "draftPayment": false,
        // Safeguard to avoid automatic payments of large amounts, default is 500 EUR.
        "maxPaymentAmount": 500,
        // Safeguard to avoid low balances on accounts, by default keep at least 1 EUR.
        "minBalance": 1,
        // Auto refresh user data automatically once per hour by default, value in minutes.
        "refreshMinutes": 60
    },
    "database": {
        "crypto": {
            "cipher": "aes-256-ctr",
            "key": "bunq-DB-cryp7o-k3y-plssss-CHANGE",
            "enabled": true
        }
    },
    "email": {
        // When the app starts up, it will initially fetch emails received on the last 24 hours.
        "fetchHours": 24
    },
    "general": {
        // Use UTF8 as default encoding for files and streams.
        "encoding": "utf8"
    },
    "strava": {
        "payments": {
            // How much should be paid per kilometer ridden?
            "pricePerKm": 0.02,
            // Process activities and payment daily or weekly.
            // If daily weekly payments will happen on Mondays.
            "interval": "weekly",
            // Time of the day in which payments are processed (24h, HH:MM format, local time).
            "time": "15:00"
        }
    }
}
